<template>
  <div>
    <questionnaire-title v-show="$route.path === '/1'" :page-name="pageName1"/>
    <questionnaire-title v-show="$route.path === '/2'" :page-name="pageName2"/>
    <questionnaire-title v-show="$route.path === '/3'" :page-name="pageName3"/>
  <!--  TODO:Обернуть question в форму-->
    <question
      v-for="(question, index1) in questions1"
      :key="index1"
      :question="question" v-show="$route.path === '/1'"
      />
    <question
      v-for="(question, index2) in questions2"
      :key="index2"
      :question="question" v-show="$route.path === '/2'"
    />
    <question
      v-for="(question, index3) in questions3"
      :key="index3"
      :question="question" v-show="$route.path === '/3'"
    />
    <navigation-button />
  </div>
</template>

<script>
import Question from '@/views/Question.vue';
import questionnaireTitle from '@/components/QuestionnaireTitle.vue';
import NavigationButton from '@/components/NavigationButton.vue';

export default {
  name: 'MainPage',
  components: { NavigationButton, Question, questionnaireTitle },
  data() {
    return {
      pageName1: 'I. ХАРАКТЕРИСТИКИ БИЗНЕСА',
      pageName2: 'II. ВОСТРЕБОВАННОСТЬ ФИНАНСОВЫХ УСЛУГ',
      pageName3: 'III. УДОВЛЕТВОРЕННОСТЬ ФИНАНСОВЫМИ УСЛУГАМИ И РАБОТОЙ РОССИЙСКИХ ФИНАНСОВЫХ ОРГАНИЗАЦИЙ, ПРЕДОСТАВЛЯЮЩИХ ЭТИ УСЛУГИ',
      pageNumber: 1,
      questions1: [
        {
          questionTitle: '1.На территории какого города (района) Липецкой области осуществляет свою деятельность Ваша организация или Вы?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: ['г. Липецк',
            'г. Елец',
            'Воловский район',
            'Грязинский район',
            'Данковский район',
            'Добринский район',
            'Добровский район',
            'Долгоруковский район',
            'Елецкий район',
            'Задонский район',
            'Измалковский район',
            'Краснинский район',
            'Лебедянский район',
            'Лев-Толстовский район',
            'Липецкий район',
            'Становлянский район',
            'Тербунский район',
            'Усманский район',
            'Хлевенский район',
            'Чаплыгинский район',
          ],
          explanation: '',
          type: 'dropdown',
        },
        {
          questionTitle: '2.Укажите, являетесь ли Вы юридическим лицом или имеете статус индивидуального предпринимателя?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'Юридическое лицо',
            'Индивидуальный предприниматель'],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '3.В течение какого периода времени Ваш бизнес осуществляет свою деятельность?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'Менее 1 года',
            'От 1 года до 3 лет',
            'От 3 лет включительно до 5 лет',
            'Более 5 лет'],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '4.Какую должность Вы занимаете в организации, которую Вы представляете?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Собственник бизнеса (совладелец)',
            'Руководитель высшего звена (генеральный директор, заместитель генерального директора или иная аналогичная позиция)',
            'Руководитель среднего звена (руководитель управления / подразделения / отдела)',
            'Не руководящий сотрудник',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '5.Какова численность сотрудников Вашей организации в настоящее время?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'До 15 человек',
            'От 16 до 100 человек',
            'От 101 до 250 человек',
            'От 251 до 1000 человек',
            'Свыше 1000 человек'],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '6.Какова примерная величина годового оборота бизнеса, который Вы представляете?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'До 120 млн. рублей (микропредприятие)',
            'От 120 до 800 млн. рублей (малое предприятие)',
            'От 800 до 2000 млн. рублей (среднее предприятие)',
            'Более 2000 млн. рублей'],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '7.К какой сфере относится деятельность бизнеса, который Вы представляете?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'Дошкольное образование',
            'Общее образование',
            'Cреднее профессиональное образование',
            'Дополнительное образования детей',
            'Психолого-педагогическое сопровождение детей с ограниченными возможностями здоровья',
            'Социальные услуги',
            'Розничная торговля лекарственными препаратами, медицинскими изделиями и сопутствующими товарами (аптеки)',
            'Медицинские услуги',
            'Ритуальные услуги',
            'Лабораторные исследования для выдачи ветеринарных сопроводительных документов',
            'Ремонт автотранспортных средств',
            'Внутренний туризм',
            'Племенное животноводство',
            'Семеноводство',
            'Жилищное строительство',
            'Строительство объектов капитального строительства, за исключением жилищного и дорожного строительства',
            'Дорожная деятельность (за исключением проектирования)',
            'Архитектурно-строительное проектирование',
            'Кадастровые и землеустроительные работы',
            'Добыча общераспространенных полезных ископаемых',
            'Теплоснабжение (производство тепловой энергии)',
            'Сбор и транспортирование твердых коммунальных отходов',
            'Благоустройство городской среды',
            'Содержание и текущий ремонт общего имущества в многоквартирном доме',
            'Купля-продажа электрической энергии (мощности)',
            'Производство электрической энергии (мощности)',
            'Нефтепродукты (бензин, дизельное топливо)',
            'Перевозка пассажиров автомобильным транспортом по муниципальным маршрутам',
            'Перевозка пассажиров автомобильным транспортом по межмуниципальным маршрутам',
            'Легкая промышленность',
            'Производство кирпича',
            'Производство бетона',
            'Услуги связи, в том числе услуг по предоставлению доступа к сети Интернет',
            'Реализация сельскохозяйственной продукции',
            'Финансовые услуги',
            'Розничная торговля продовольственными товарами',
            'Розничная торговля непродовольственными товарами',
            'Оптовая торговля',
            'Ремонт и монтаж машин и оборудования',
            'Бытовое обслуживание',
            'Деятельность гостиниц и предприятий общественного питания',
            'Деятельность по операциям с недвижимым имуществом',
            'Деятельность по страхованию',
            'Рыболовство и рыбоводство',
            'Другое',
          ],
          explanation: '',
          type: 'dropdown',
        },
        {
          questionTitle: '8.Основной продукцией (товаром, работой, услугой) бизнеса, который Вы представляете, является?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'Услуги',
            'Сырье или материалы для дальнейшей переработки',
            'Компоненты для производства конечной продукции',
            'Конечная продукция',
            'Бизнес осуществляет торговлю или дистрибуцию товаров и услуг, произведенных другими компаниями',
            'Другое',
          ],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '9.Какова примерная величина годового оборота бизнеса, который Вы представляете?',
          numberOfResponses: '(пожалуйста, укажите один вариант ответа)',
          answers: [
            'Локальный рынок (одно муниципальное образование)',
            'Рынок Липецкой области',
            'Рынки нескольких субъектов Российской Федерации',
            'Рынок Российской Федерации',
            'Рынки стран СНГ',
            'Рынки стран зарубежья (кроме стран СНГ)',
            'Затрудняюсь ответить',
          ],
          explanation: '* под основным рынком подразумевается тот географический рынок, где регулярно реализуется наибольшая доля продукции (товара, работы, услуги) бизнеса',
          type: 'single',
        },
      ],
      questions2: [
        {
          questionTitle: '10.Какими из перечисленных финансовых продуктов (услуг) Вы пользовались за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Имеется сейчас',
            'Не имеется сейчас, но использовался за последние 12 месяцев',
            'Не использовался за последние 12 месяцев'],
          body: [
            { title: 'Банковский вклад (депозит)' },
            { title: 'Договор на размещение средств в форме займа в микрофинансовой организации' },
            { title: 'Договор на размещение средств в форме займа в кредитном потребительском кооперативе' },
            { title: 'Договор на размещение средств в форме займа в сельскохозяйственном кредитном потребительском кооперативе' },
            { title: 'Индивидуальный инвестиционный счет' },
            { title: 'Инвестиционное страхование жизни' },
            { title: 'Брокерский счет' },
            { title: 'Вложение средств в паевой инвестиционный фонд' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '11.Если Вы не размещали за последние 12 месяцев денежные средства в финансовых организациях, укажите причины, по которым Вы не пользовались данной услугой?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Отделения финансовых организаций находятся слишком далеко от меня',
            'Предлагаемая процентная ставка слишком низкая (для продуктов с процентным доходом)',
            'Я не доверяю финансовым организациям в достаточной степени, чтобы размещать в них денежные средства',
            'У меня недостаточно свободных денег',
            'Использую другие способы размещения свободных денежных средств (недвижимость, покупка украшений, антиквариата)',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '12.Какими из перечисленных финансовых продуктов (услуг) Вы пользовались за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Имеется сейчас',
            'Не имеется сейчас, но использовался за последние 12 месяцев',
            'Не использовался за последние 12 месяцев'],
          body: [
            { title: 'Онлайн-кредит в банке (договор заключен с использованием информационно-телекоммуникационной сети «Интернет», сумма кредита предоставлена получателю финансовой услуги в безналичной форме)' },
            { title: 'Иной кредит в банке, не являющийся онлайн-кредитом' },
            { title: 'Использование кредитного лимита по кредитной карте' },
            { title: 'Онлайн-заём в микрофинансовой организации (договор заключен с использованием  информационно-телекоммуникационной сети «Интернет», сумма кредита представлена получателю финансовой услуги в безналичной форме)' },
            { title: 'Иной заём в микрофинансовой организации, не являющийся онлайн-займом' },
            { title: 'Онлайн-заём в кредитном потребительском кооперативе' },
            { title: 'Иной заём в кредитном потребительском кооперативе,  не являющийся онлайн-займом' },
            { title: 'Онлайн-заём в сельскохозяйственном кредитном потребительском кооперативе' },
            { title: 'Иной заём в сельскохозяйственном кредитном потребительском кооперативе,  не являющийся онлайн-займом' },
            { title: 'Заём в ломбарде' },
            { title: 'Лизинг' },
            { title: 'Факторинг' },
            { title: 'Краудфандинг (добровольное коллективное сотрудничество людей, объединяющих свои финансовые ресурсы для реализации проекта)' },
            { title: 'Инструменты фондового рынка' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '13.Если Вы не пользовались за последние 12 месяцев кредитными продуктами финансовых организаций, укажите причины, по которым Вы не пользовались данной услугой?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Отделения финансовых организаций находятся слишком далеко от меня',
            'Процентная ставка слишком высокая',
            'Я не доверяю финансовым организациям в достаточной степени, чтобы привлекать у них денежные средства',
            'У меня нет необходимых документов (паспорт или иной документ, удостоверяющий личность и т.д.)',
            'Не люблю кредиты/займы/не хочу жить в долг',
            'Использую другие способы получить заём (неформальные источники (родные и друзья) и др.)',
            'Нет необходимости в заемных средствах',
            'Я не обладаю навыками использования онлайн-сервисов финансовых организаций для получения кредита (займа)',
            'Я не уверен в технической безопасности онлайн-сервисов финансовых организаций',
            'Нет возможности предоставить обеспечение по кредиту (займу)',
            'Финансовая организация отказала в предоставлении кредита (займа, лизинге, факторинге)',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '14.Какими из перечисленных платежных карт Вы пользовались за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Имеется сейчас',
            'Не имеется сейчас, но использовался за последние 12 месяцев',
            'Не использовался за последние 12 месяцев'],
          body: [
            { title: 'Зарплатная карта (банковская карта, предназначенная для выплаты сотруднику заработной платы и других денежных начислений (премий, командировочных, материальной помощи и т.д.) организацией, заключившей с банком договор на обслуживание в рамках зарплатного проекта)' },
            { title: 'Расчетная (дебетовая) карта для получения пенсий и иных социальных выплат' },
            { title: 'Другая расчетная (дебетовая) карта, кроме зарплатной карты и (или) карты для получения пенсий и иных социальных выплат' },
            { title: 'Кредитная карта' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '15.Если за последние 12 месяцев Вы не пользовались платежными картами, укажите причину отсутствия у Вас платежных карт',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Отделения банков находятся слишком далеко от меня',
            'Банкоматы находятся слишком далеко от меня',
            'В организациях торговли (услуг), которыми я обычно пользуюсь, нет возможности проводить безналичную оплату за товары (услуги) с помощью банковской карты через POS-терминал',
            'Обслуживание счета/платежной карты стоит слишком дорого',
            'У меня нет необходимых документов (паспорт или иной документ, удостоверяющий личность, документ о выплате заработной платы, справка с места работы, и т.д.)',
            'У меня недостаточно денег для хранения их на счете/платежной карте и использования этих финансовых продуктов',
            'Я не доверяю банкам (кредитным организациям)',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '16.Пользовались ли Вы за последние 12 месяцев текущим счетом (расчетным счетом без возможности получения дохода в виде процентов, отличным от счета по вкладу или счета платежной карты)?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Да',
            'Нет',
          ],
          explanation: '',
          type: 'single',
        },
        {
          questionTitle: '17.Пользовались ли Вы следующими типами дистанционного доступа к банковскому счету (расчетному счету, счету по вкладу, счету платежной карты) за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Да',
            'Нет'],
          body: [
            { title: 'Денежные переводы/платежи через интернет-банк с помощью стационарного компьютера или ноутбука (через веб-браузер)' },
            { title: 'Денежные переводы/платежи через интернет-банк с помощью планшета или смартфона  (через веб-браузер на мобильном устройстве без использования специального приложения (программы) и без использования смс-команд (однако на номер телефона могут приходить подтверждающие коды)' },
            { title: 'Денежные переводы/платежи через мобильный банк с помощью специализированного мобильного приложения (программы)  для смартфона или планшета' },
            { title: 'Денежные переводы/платежи через мобильный банк посредством сообщений с использованием мобильного телефона – с помощью отправки смс на короткий номер' },
            { title: 'Система быстрых платежей (СБП) для оплаты гражданами товаров (услуг)' },
            { title: 'Мобильное приложение СБПэй, с помощью которого граждане могут расплачиваться в торгово-сервисных предприятиях, подключенных к Системе быстрых платежей (СБП)' },
            { title: 'Осуществление перевода (отправка, прием) денежных средств в отчетном периоде без открытия банковского счета' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '18.Если за последние 12 месяцев Вы не пользовались дистанционным доступом к банковскому счету (расчетному счету, счету по вкладу, счету платежной карты), укажите причины, по которым Вы не пользовались данной услугой',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'У меня нет компьютера, ноутбука, планшета, смартфона',
            'У меня отсутствует возможность интернет-подключения или качество интернета не позволяет получить дистанционный доступ к финансовым услугам',
            'Я не уверен в безопасности интернет-сервисов',
            'Я не обладаю навыками использования таких технологий',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '19.Какими из перечисленных страховых продуктов (услуг) Вы пользовались за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Имеется сейчас',
            'Не имеется сейчас, но использовался за последние 12 месяцев',
            'Не использовался за последние 12 месяцев'],
          body: [
            { title: 'Добровольное страхование жизни (на случай смерти, дожития до определенного возраста или срока либо наступления иного события; с условием периодических выплат (ренты, аннуитетов) и/или участием страхователя в инвестиционном доходе страховщика; пенсионное страхование)' },
            { title: 'Другое добровольное страхование, кроме страхования  жизни (добровольное личное страхование от несчастных случаев и болезни, медицинское страхование; добровольное имущественное страхование; добровольное страхование гражданской ответственности  (например, дополнительное страхование автогражданской ответственности (ДСАГО), но не обязательное страхование автогражданской ответственности (ОСАГО); добровольное страхование финансовых рисков)' },
            { title: 'Другое обязательное страхование, кроме обязательного медицинского страхования (обязательное личное страхование пассажиров (туристов), жизни и здоровья пациента, участвующего в клинических исследованиях лекарственного препарата для медицинского применения,  государственное личное страхование работников налоговых органов, государственное страхование жизни и здоровья военнослужащих и приравненных к ним в обязательном государственном страховании лиц; ОСАГО)' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '20.Если за последние 12 месяцев Вы не пользовались добровольным страхованием, укажите причины, по которым Вы не пользовались данной услугой?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Отделения страховых организаций (а также страховые брокеры или общества взаимного страхования) находятся слишком далеко от меня',
            'Стоимость страхового полиса слишком высокая',
            'Другие невыгодные условия страхового договора',
            'Я не доверяю страховым организациям',
            'Не вижу смысла в страховании',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '21.В какой форме Вы принимаете платежи при продаже товаров и предоставлении услуг?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Оплата наличными денежными средствами',
            'Оплата в безналичной форме – банковской картой',
            'Оплата в безналичной форме – перевод по реквизитам по счету',
            'Оплата в безналичной форме – через систему быстрых платежей для МСП',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '22.Если Вы принимаете платежи при продаже товаров и предоставлении услуг только в наличной форме укажите причины, по которым вы не принимаете оплату в безналичной форме?',
          numberOfResponses: '(пожалуйста, выберите один или несколько вариантов ответа в соответствующей ячейке)',
          answers: [
            'Высокая комиссия за эквайринг',
            'Низкое качество интернет-связи, сбои в работе оборудования',
            'Мне не известно про систему быстрых платежей для МСП',
            'Необходимы наличные денежные средства для расчета с контрагентами при покупке товаров и получении услуг',
            'Другое',
          ],
          explanation: '',
          type: 'multiple',
        },
        {
          questionTitle: '23.Какими из перечисленных страховых продуктов (услуг) Вы пользовались за последние 12 месяцев?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Знаю, уже воспользовались',
            'Знаю, но не нуждаюсь в них',
            'Мне отказали в предоставлен',
            'Не знаю, не нуждаюсь в них',
            'Не знаю, но  воспользуемся'],
          body: [
            { title: 'Льготное кредитование, предоставление займов' },
            { title: 'Гарантийная поддержка' },
            { title: 'Субсидирование купонных выплат, затрат при выпуске облигаций' },
            { title: 'Другое' },
          ],
          explanation: '',
          type: 'table',
        },
      ],
      questions3: [
        {
          questionTitle: '24.Насколько Вы удовлетворены работой/ сервисом следующих финансовых организаций при оформлении и/или использовании финансовых услуг или в любых других случаях, когда Вы сталкивались с ними?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Полностью не удовлетворен',
            'Скорее не удовлетворен',
            'Скорее удовлетворен',
            'Полностью удовлетворен',
            'Не сталкивался'],
          body: [
            { title: 'Банки' },
            { title: 'Микрофинансовые организации' },
            { title: 'Кредитные потребительские кооперативы' },
            { title: 'Ломбарды' },
            { title: 'Субъекты страхового дела (страховые организации, общества взаимного страхования и страховые брокеры)' },
            { title: 'Сельскохозяйственные кредитные потребительские кооперативы' },
            { title: 'Негосударственные пенсионные фонды' },
            { title: 'Брокеры' },
          ],
          explanation: '',
          type: 'table',
        },
        {
          questionTitle: '25.Насколько Вы доверяете следующим финансовым организациям?',
          numberOfResponses: '(пожалуйста, выберите один вариант ответа для каждого финансового продукта)',
          head: [
            'Полностью не удовлетворен',
            'Скорее не удовлетворен',
            'Скорее удовлетворен',
            'Полностью удовлетворен',
            'Не сталкивался'],
          body: [
            { title: 'Банки' },
            { title: 'Микрофинансовые организации' },
            { title: 'Кредитные потребительские кооперативы' },
            { title: 'Ломбарды' },
            { title: 'Субъекты страхового дела (страховые организации, общества взаимного страхования и страховые брокеры)' },
            { title: 'Сельскохозяйственные кредитные потребительские кооперативы' },
            { title: 'Негосударственные пенсионные фонды' },
            { title: 'Брокеры' },
          ],
          explanation: '',
          type: 'table',
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>

</style>
