<template>
  <div>
    <p v-for="(p, index) in paragraphs" :key="index">{{ p }}</p>
    <h3>АНКЕТА<br>для предпринимателей</h3>
    <h3>{{ pageName }}</h3>
  </div>
</template>

<script>

export default {
  name: 'questionnaireTitle',
  props: {
    pageName: {
      type: String,
      default: '',
    },
  },
  data() {
    return {
      paragraphs: ['Управление экономического развития Липецкой области проводит опрос мнения\n'
          + 'предпринимателей в отношении доступности финансовых услуг и \n'
          + 'удовлетворенности деятельностью в сфере финансовых услуг, \n'
          + 'осуществляемой на территории Липецкой области\n',
      'Пожалуйста, ответьте на ряд вопросов, посвященных Вашей оценке \n'
            + 'уровня доступности финансовых услуг, удовлетворенности этими услугами и работой российских финансовых организаций, представляющих эти услуги в регионе.\n'
            + 'Заполнение анкеты займет у Вас около 10-15 минут. \n',
      'Опрос является анонимным и строго конфиденциальным. Все полученные результаты будут использоваться только в обобщенном виде.',
      'Заранее благодарим за участие в исследовании!'],
    };
  },
};
</script>

<style lang="scss" scoped>
h3, p {
  text-align: center;
  margin-bottom: 1rem;
}

h3 {
  font-size: 1.5rem;
}

p {
  font-size: 1rem;
}
</style>
